from django.shortcuts import render

# Create your views here.
import os
from django.conf import settings

from rest_framework.views import APIView
from rest_framework.response import Response
from rest_framework import status

import pickle
import numpy as np
import pandas as pd

class Knearest_api(APIView):

	def __init__(self):
		self.res_path = os.path.join(settings.PROJECT_ROOT, '..','knearest_api', 'res')
		self.cardata_path = os.path.join(self.res_path, 'claimData-12-J10.xls')
		self.features_sample = [15, 300, 160]
		self.cars = pd.read_csv(self.cardata_path)
		self.featues_len = len(self.features_sample)
		self.modelpath = os.path.join(self.res_path, 'hospital_recom_64.pickle')
		#print(self.modelpath)
		#print(self.cars)

	def get(self, request, *args, **kw):
		# Any URL parameters get passed in **kw
		result = {"mpg": 15, "disp": 300, "hp": 160, "wt": 3.2}
		response = Response(result, status=status.HTTP_200_OK)
		return response

	def post(self, request, *args, **kw):
		data = request.data
		# print(f"""
		#		Age : {data['AGE']}
		#		Annual premium: {data['ANNUAL_PAYMENT_AMT']}
		#		gender: {data['GENDER_TYPE']}
		#		disese: {data['diseases']}
		#		""")

		#features_in = self.features_sample
		print(data)
		features_in = list(data.values())
		#print(features_in)
		if len(features_in) < self.featues_len:
			result = {"error": "input length"}
			return Response(result, status=status.HTTP_400_BAD_REQUEST)

		pred = self.k3nnbrecommender(features_in)
		#print(type(pred))

		result = {"result": pred}
		response = Response(result, status=status.HTTP_200_OK)
		return response

	def k3nnbrecommender(self, features_in):
		#setup column name
		#self.cars.columns = ['AGE_CLASS', 'ANNUAL_PAYMENT_AMT', 'GENDER_TYPEB']

		print(self.modelpath)
		with open(self.modelpath,'rb') as f:
			loadCarsNearestNeighborsX3 = pickle.load(f)

		# predict
		pred = loadCarsNearestNeighborsX3.kneighbors([features_in])
		print(pred)
		print(pred[1])
		hospitalName = {84571007:'บริษัท มงกุฎวัฒนะ จำกัด (มหาชน)',
						84571008:'บริษัท โรงพยาบาลไทยนครินทร์ จำกัด (มหาชน)',
						84571010:'บริษัท สายวิชัยพัฒนา จำกัด',
						84571011:'บริษัท ศูนย์การแพทย์ไทย จำกัด (มหาชน)',
						84571012:'บริษัท สินแพทย์ จำกัด',
						84571013:'บริษัท ศิครินทร์ จำกัด (มหาชน)',
						84571015:'บริษัท กรุงเทพดุสิตเวชการ จำกัด (มหาชน)',
						84571019:'โรงพยาบาลกรุงเทพคริสเตียน',
						84571023:'บริษัท โรงพยาบาลบางโพ จำกัด',
						84571024:'บริษัท โรงพยาบาลบำรุงราษฎร์ จำกัด(มหาชน)',
						84571026:'บริษัท แอดวานซ์ เมดิคอล เซนเตอร์ จำกัด',
						84571029:'บริษัท โรงพยาบาลเจ้าพระยา จำกัด(มหาชน)',
						84571031:'บริษัท ธนบุรี เฮลท์แคร์ กรุ๊ป จำกัด(มหาชน)',
						84571032:'โรงพยาบาลหัวเฉียว',
						84571035:'บริษัท บางกอก เชน ฮอสปิทอล จำกัด (มหาชน)',
						84571040:'บริษัท เมโยโพลีคลีนิค จำกัด',
						84571041:'โรงพยาบาล เมโมเรียล พหลโยธิน',
						84571043:'บริษัท โรงพยาบาลพญาไท 1 จำกัด',
						84571044:'บริษั โรงพยาบาลพญาไท 2 จำกัด',
						84571049:'บริษัท โรงพยาบาลรามคำแหง จำกัด (มหาชน)',
						84571050:'บริษัท บางปะกอก ฮอสพิทอล กรุ๊ปจำกัด',
						84571053:'บริษัท สมิติเวช จำกัด',
						84571055:'บริษัท การแพทย์สยาม จำกัด',
						84571057:'โรงพยาบาลเซนต์หลุยส์',
						84571058:'บริษัท ปิยะศิริ จำกัด ( โรงพยาบาลสุขุมวิท )',
						84571061:'บริษัท โรงพยาบาลวิภาวดี จำกัด(มหาชน)',
						84571062:'บริษัท วิชัยยุทธ จำกัด',
						84571065:'โรงพยาบาลพญาไท 3',
						84571082:'โรงพยาบาลจักษุรัตนิน',
						84571092:'โรงพยาบาลตา หู คอ จมูก',
						84571098:'บริษัท เทพธัญญภา จำกัด',
						84571128:'บริษัท โรงพยาบาลพระรามเก้า จำกัด',
						84571176:'บริษัท โรงพยาบาลนครธน จำกัด',
						84571201:'บริษัท บีเอ็นเอช เมดิเคิล เซ็นเตอร์ จำกัด',
						84571203:'บริษัท โรงพยาบาลลาดพร้าว จำกัด',
						84571208:'บริษัท ธนบุรี เฮลท์แคร์ กรุ๊ป จำกัด(มหาชน)',
						84571223:'บริษัท บางกอก เชน ฮอสปิทอล จำกัด (มหาชน)',
						84571227:'บริษัท สมิติเวช จำกัด (มหาชน)',
						84571228:'บริษัท โรงพยาบาลวิภาราม จำกัด',
						84571229:'บริษัท แอร์พอร์ตเนิสซิ่งโฮม จำกัด',
						84571583:'โรงพยาบาลบางปะกอก9อินเตอร์เนชั่นแนล',
						84571617:'บริษัท โรงพยาบาลสายไหม จำกัด',
						84571860:'โรงพยาบาลเสรีรักษ์',
						84572183:'บริษัท โรงพยาบาลธนกาญจน์ จำกัด',
						84572281:'บริษัท โรงพยาบาลเมืองนารายณ์ จำกัด',
						84572323:'บริษัท โรงพยาบาลกรุงเทพสนามจันทร์ จำกัด',
						84572327:'โรงพยาบาลกรุงเทพคริสเตียน นครปฐม',
						84572346:'โรงพยาบาลศาลายา',
						84572370:'สถาพรจักษุแพทย์',
						84572432:'โรงพยาบาลนนทเวช',
						84572443:'บริษัท โรงพยาบาลรัตนาธิเบศร์ จำกัด',
						84572590:'บริษัท ปทุมรักษ์ จำกัด',
						84572603:'โรงพยาบาลกรุงสยามเซนต์คาร์ลอส',
						84572727:'บริษัท โรงพยาบาลราชธานี จำกัด(มหาชน)',
						84572823:'บจ.โรงพยาบาลกรุงเทพเมืองราช',
						84572947:'บริษัท เปาโล สมุทรปราการ จำกัด',
						84574109:'บริษัท เพชรเกษมเวชกิจ จำกัด',
						84574110:'บริษัท ศรีวิชัยเวชวิวัฒน์ จำกัด',
						84574112:'บริษัท โรงพยาบาลมหาชัย จำกัด (มหาชน)',
						84574144:'คลินิกหมอสงกรานต์',
						84574146:'โรงพยาบาลเอกชัย',
						84574226:'บริษัท โรงพยาบาลเมโมเรียลสระบุรี จำกัด',
						84574337:'โรงพยาบาลศุภมิตร',
						84574415:'บริษัท โสธราเวช จำกัด',
						84574532:'บริษัท วัฒนเวช จำกัด',
						84574533:'บริษัท สิริเวชจันทบุรี จำกัด',
						84574571:'คลินิกตาหมอพิพัฒน์',
						84574606:'บริษัท สมิติเวช ศรีราชา จำกัด',
						84574609:'บริษัท โรงพยาบาลศรีราชานคร จำกัด (มหาชน)',
						84574611:'โรงพยาบาลกรุงเทพพัทยา',
						84574642:'บริษัท โรงพยาบาลเอกชล จำกัด (มหาชน)',
						84575096:'บริษัท โรงพยาบาลกรุงเทพระยอง จำกัด',
						84575132:'คลีนิคศูนย์โรคตาระยอง',
						84575294:'บริษัท โรงพยาบาลกรุงเทพตราด จำกัด',
						84575309:'พิชิต-สิริรักษ์ คลีนิค',
						84575605:'โรงพยาบาลขอนแก่นราม',
						84575802:'บริษัท โรงพยาบาลกรุงเทพ ราชสีมา จำกัด',
						84575803:'โรงพยาบาลเซนต์แมรี่',
						84575846:'โรงพยาบาลกรุงเทพ ปากช่อง',
						84580227:'บริษัทอุบลรักษ์ จำกัด',
						84580438:'บริษัท โรงพยาบาลชุมเวช จำกัด (มหาชน)',
						84580543:'บริษัท นครินทร์พัฒนาเวชกิจ จำกัด',
						84580544:'บริษัท มิตรกูลเวชการและพัฒนา จำกัด',
						84580756:'หมอวิสินโพลีคลีนิค',
						84580854:'บริษัท โรงพยาบาลปิยะรักษ์ จำกัด',
						84580885:'สถานพยาบาลผลกำเนิดศิริ',
						84580935:'บริษัท โรงพยาบาลกรุงเทพภูเก็ต จำกัด',
						84580942:'โรงพยาบาลสิริโรจน์ 2',
						84581118:'โรงพยาบาลราษฎร์ยินดี',
						84581151:'บริษัท โรงพยาบาลศิครินทร์หาดใหญ่ จำกัด',
						84581153:'โรงพยาบาลกรุงเทพหาดใหญ่',
						84581281:'บริษัท สุราษฎร์เวชกิจ จำกัด',
						84581420:'โรงพยาบาลวัฒนแพทย์ตรัง',
						84581425:'โรงพยาบาลตรังรวมแพทย์',
						84581489:'โรงพยาบาลสิโรรส',
						84581562:'โรงพยาบาลเชียงใหม่ราม',
						84581565:'บริษัท เชียงใหม่รามธุรกิจการแพทย์ จำกัด',
						84581687:'บริษัท ศรีบุรินทร์การแพทย์ จำกัด',
						84581938:'บริษัท โรงพยาบาลศรีสวรรค์ จำกัด',
						84583289:'บริษัท โรงพยาบาลพะเยาราม จำกัด'}
		# return
		cars_recommend = []
		for idx in pred[1][0]:
			#dat_list = self.cars.iloc[idx].values.tolist()
			#dat_json = self.cars.iloc[idx].to_json()
			dat_dict = self.cars.iloc[idx]['HOSPITALID']
			print(dat_dict)
			dat_name = hospitalName.get(dat_dict)
			#print(type(dat_dict))
			#print(dat_dict)
			if(dat_name):
				cars_recommend.append(dat_name)


		#print(cars_recommend)
		return {k+1: v for k, v in enumerate(cars_recommend)}